using System;
using System.Text.RegularExpressions;

namespace P02_DemoNames
{
    class Program
    {
        public static void Main()
        {
            string pattern = @"[А-Я][a-я]+ [А-Я][а-я]+";

            RegexOptions options = RegexOptions.Multiline;

            MatchCollection names = Regex.Matches(input, pattern, options);

           var result= Regex.Replace(input, pattern, "***");

            Console.WriteLine(result);

            foreach (Match m in names)
            {
                Console.WriteLine("'{0}' found at index {1}.", m.Value, m.Index);
            }
        }
        private static string input = @"От днес за 10 дни в цялата страна влиза в сила трето затваряне с цел ограничаване разпространението на коронавируса. Преустановяват се присъствените учебни занятия в училищата, яслите и детските градини. Затварят се ресторантите, моловете, кината и театрите. 

Работа преустановяват игралните зали, казината и търговските площи на 300 квадратни метра с изключение на хранителните супермаркети. Ресторантите ще могат да работят само за доставки и вземане на храна за дома и офиса. Мерките включват още задължително еднопосочно движение на всички пазари в страната. Затварят се фитнеси, плувни комплекси, музеите и танцовите школи. Забраняват се сватби и кръщенета с над 15 души. Висшите училища също преустановяват учебните занятия с изключение на практически упражнения по клинични дисциплини.

Главният държавен здравен инспектор доцент Ангел Кунчев коментира, че наблюденията в други европейски държави показват че последният пик на заболеваемостта от Covid-19 е с продължителност между две и четири седмици: ""10 дни не е малък срок, очевидно намаляването на контактите, ще окаже влияние но дали ще е достатъчно, това вече ми е трудно да кажа. Едно намаляване на контактите в този момент би трябвало да повлияе.""

В София отворени остават две  детски градини за деца на медици на първа линия -  117-а детска градина ""Надежда"" в район ""Младост"" и 124-та ""Бърборино"" в район ""Красно село"".

з не знам колко живота трябва да вземе това ""грипче"", за да разберем, че това не е просто ""грипче"", а е смъртоносно. Че има много хора, които страдат и се борят за глътка въздух, и да разберем, че трябва да сме съпричастни към болката и страданието"", каза говорителят на Спешна помощ Катя Сунгарска пред БТВ. Тя определи като парадокс, че на везните от едната страна се поставят здравето и живота, а от другата страна - отварянето на ресторантите.

""Коронавирусът е невидим враг. Ние възприемаме ситуацията като война вече година. Въпреки че сме от едната страна на барикадата, а медиците са на първата линия, те са обстрелвани и от врага, и в тила. Не знам да има друг случай в историята тези, които защитаваш да те обстрелват"", казва Сунгарска. По думите й е крайно безотговорно вече година да се говори, че носенето на маски е важно, какви мерки да се вземат и за спазването на дистанция.

""На миналите протести слоганът беше ""Ние не носим маски"". Да, обаче нашата практика установи, че една немалка част от хората, които призоваха за това, когато им опря ножа до кокала и станаха наши пациенти, започнаха с претенциите къде да бъдат закарани, как да бъдат лекувани"", казва Сунгарска.

За последната година столичната Спешна помощ е загубила девет човека. ""Това беше най-голямата ни трагедия. Когато губиш хора от обкръжението си много боли"", допълва Сунгарска.

""Безотговорността ни мъчи най-много"", казва Иван Петров говорителят на Спешна помощ. Тя разказа, че все още има хора, които лъжат за симптомите си по телефона и когато медиците стигнат на адреса, установяват, че лицето е с коронавирус. Друг абсурден случай от работата в последната година е на жена, която по телефона описва симптомите си и, че ""почти умира"".

""Когато отиде лекарят на място, жената му каза ""Виждам, че имаш чанта, сигурно има инструменти вътре... Хайде да ми обезвъздушиш парното, защото ми е студено"", казва Сунгарска. ""В този момент не един, а повече хора са в животозастрашаващи състояния и може да загубят живота си"", казва тя. Тя поиска хората да запазят Димитър Бербатов някакво достойнство в тази ситуация. ""Не знам какво да призова хората. Аз вече се срамувам да говоря, защото се повтаря едно и също и някакви хора не искат да погледнат по-далече от носа си, от егото си, от лакомията си. Това е безобразие"", каза Сунгарска. Тя благодари на всичките си колеги, които продължават да работят в ситуация на пълно себеотрицание.";
    }

}
