using System;
using System.Text.RegularExpressions;

public class Example
{
    public static void Main()
    {
        string pattern = @"[\d]+ [а-я]+ [\d]+";
        string pattern2 = @"[А-Я][а-я]+";
        string input = @"В капана на зимата: Затворени пътища, закъсали тирове и ограничено движение в страната
Вижте къде има затруднения в трафика
21 февруари 2026, 10:24
Оранжев код за валежи от дъжд и сняг е обявен за днес за девет области в страната, съобщиха на сайта си от НИМХ. Предупреждението е за областите Кърджали, Хасково, Стара Загора, Габрово,  както и за части от Пловдив, Ямбол, Смолян, Велико Търново и Сливен. 

Обилен снеговалеж в София, има промяна в маршрута на градския транспорт

НИМХ обяви жълт код за дъжд и снеговалежи за областите Пазарджик, Ловеч, Плевен, Русе, Търговище, Силистра, Добрич, Варна, Разград, Шумен, както и за някои населени места в областите  Бургас, Велико Търново, Пловдив,  Сливен и Смолян.

По автомагистрала ""Тракия"" движението се осъществява бавно заради обилния снеговалеж и намалената видимост.

260 снегопочистващи машини обработват 21 септември 2026настилките по републиканските пътища. Сняг вали в 14 области.

Временно поради обилен снеговалеж и почистване е ограничено преминаването на тежкотоварни автомобили с ремаркета и полуремаркета през проходите „Рожен“, „Превала“, както и за част от републиканските пътища в областите Русе, Смолян, Разград и Шумен. Ограничения са въведени  в участъци от път I-5 Русе–Бяла, I-2 Русе–Разград–Шумен.";

        RegexOptions options = RegexOptions.Multiline;

        foreach (Match m in Regex.Matches(input, pattern, options))
        {
            Console.WriteLine("'{0}' found at index {1}.", m.Value, m.Index);
        }

        foreach (Match m in Regex.Matches(input, pattern2, options))
        {
            Console.WriteLine("'{0}' found at index {1}.", m.Value, m.Index);
        }
    }
}
