using System;
using System.Text;

namespace P19_ControlSymbols
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.OutputEncoding = Encoding.UTF8;

            Console.WriteLine(@"Управляващите знаци са с кодове от 0 до 31 в таблицата Unicode. 
Някои от тях се използват за форматиране на изхода при методите за извеждане.
Тъй като тези знаци нямат свое графично изображение, прието е да се изписват с някакъв знак, напомнящ за предназначението им при форма -тиране на изхода, предшестван от знака обратна наклонена черта(\).");
            Console.WriteLine($"Управляващите знаци\n са с кодове от 0 до 31 в таблицата Unicode.\n \tНякои от тях се използват за форматиране на изхода при методите за извеждане. Тъй като тези знаци нямат свое графично изображение, прието е да се изписват с някакъв знак, напомнящ за предназначението им при форма -тиране на изхода, предшестван от знака обратна наклонена черта(\\).");
        }
    }
}
